In [ ]:
На примере датасета titanic.csv
https://yadi.sk/d/TfhJdE2k3EyALt

In [4]:
import pandas as pd

In [5]:
df_titanic = pd.read_csv("datasets/titanic.csv")
#df_titanic = pd.read_csv("alrs_m30.csv")

In [15]:
# Переименовываю поле без название в PassengerID
#df_titanic = df_titanic.rename(columns={'Unnamed: 0': 'PassengerID'})

In [6]:
df_titanic.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [7]:
df_tmp = df_titanic.head()

In [9]:
print(map(lambda c: c, df_tmp))

<map object at 0x0000000005507A20>

In [ ]:
Необходимо подсчитать сколько женщин и мужчин выжило

In [28]:
df_titanic.loc[df_titanic.Survived== 1]

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,6,"Anderson, Mr Harry",1st,47.00,male,1,0
6,7,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
8,9,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
11,12,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.00,female,1,1
12,13,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
13,14,"Barkworth, Mr Algernon H",1st,NaN,male,1,0
15,16,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.00,female,1,1
18,19,"Beckwith, Mr Richard Leonard",1st,37.00,male,1,0
19,20,"Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.00,female,1,1
20,21,"Behr, Mr Karl Howell",1st,26.00,male,1,0
22,23,"Bishop, Mr Dickinson H",1st,25.00,male,1,0
23,24,"Bishop, Mrs Dickinson H (Helen Walton)",1st,19.00,female,1,1
24,25,"Bjornstrm-Steffansson, Mr Mauritz Hakan",1st,28.00,male,1,0
26,27,"Blank, Mr Henry",1st,39.00,male,1,0
27,28,"Bonnell, Miss Caroline",1st,30.00,female,1,1
28,29,"Bonnell, Miss Elizabeth",1st,58.00,female,1,1
30,31,"Bowen, Miss Grace Scott",1st,45.00,female,1,1
31,32,"Bowerman, Miss Elsie Edith",1st,22.00,female,1,1
32,33,"Bradley, Mr George",1st,NaN,male,1,0
36,37,"Brown, Mrs James Joseph (Margaret Molly"" Tobin)""",1st,44.00,female,1,1
37,38,"Brown, Mrs John Murray (Caroline Lane Lamson)",1st,59.00,female,1,1
38,39,"Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.00,female,1,1
40,41,"Calderhead, Mr Edward P",1st,NaN,male,1,0
41,42,"Candee, Mrs Edward (Helen Churchill Hungerford)",1st,53.00,female,1,1
42,43,"Cardeza, Mrs James Warburton Martinez (Charlot...",1st,58.00,female,1,1
43,44,"Cardeza, Mr Thomas Drake Martinez",1st,36.00,male,1,0
47,48,"Carter, Mr William Ernest",1st,36.00,male,1,0
48,49,"Carter, Mrs William Ernest (Lucile Polk)",1st,36.00,female,1,1
...,...,...,...,...,...,...,...
1098,1099,"Osman, Miss Maria",3rd,NaN,female,1,1
1122,1123,"Pekoniemi, Mr Edvard",3rd,NaN,male,1,0
1125,1126,"Persson, Mr Ernst Ulrik",3rd,NaN,male,1,0
1136,1137,"Pickard (Trembisky), Mr Berk",3rd,NaN,male,1,0
1151,1152,"Riordan, Miss Hannah",3rd,NaN,female,1,1
1161,1162,"Roth, Miss Sarah",3rd,NaN,female,1,1
1164,1165,"Ryan, Mr Edward Ryan",3rd,NaN,male,1,0
1167,1168,"Saad, Khalil",3rd,NaN,male,1,0
1182,1183,"Salkjelsvik, Miss Anna",3rd,NaN,female,1,1
1187,1188,"Sandstrom, Miss Hjalmar",3rd,NaN,female,1,1
1199,1200,"Sheerlinck, Mr Jean",3rd,NaN,male,1,0
1201,1202,"Shine, Miss Ellen",3rd,NaN,female,1,1
1207,1208,"Sjoblom, Miss Anna Sofia",3rd,NaN,female,1,1
1219,1220,"Smyth, Miss Julia",3rd,NaN,female,1,1
1222,1223,"Sop, Mr Jules",3rd,NaN,male,1,0
1226,1227,"Stanley, Miss Amy Zilla Elsie",3rd,NaN,female,1,1
1231,1232,"Stranden, Mr Juho",3rd,NaN,male,1,0
1235,1236,"Sunderland, Mr Victor Francis",3rd,NaN,male,1,0
1239,1240,"Svensson, Mr Johan Cervin",3rd,NaN,male,1,0
1242,1243,"Tenglin, Mr Gunnar Isidor",3rd,NaN,male,1,0
1244,1245,"Thomas, Mrs Alexander",3rd,NaN,female,1,1
1251,1252,"Thorneycroft, Mrs Percival",3rd,NaN,female,1,1
1258,1259,"Tornquist, Mr William Henry",3rd,25.00,male,1,0
1263,1264,"Turja, Miss Anna Sofia",3rd,18.00,female,1,1
1264,1265,"Turkula, Mrs Hedvig",3rd,63.00,female,1,1
1279,1280,"Vartunian, Mr David",3rd,22.00,male,1,0
1289,1290,"Wennerstrom, Mr August Edvard",3rd,NaN,male,1,0
1293,1294,"Wilkes, Mrs Ellen",3rd,45.00,female,1,1
1302,1303,"Yalsevac, Mr Ivan",3rd,NaN,male,1,0
1304,1305,"Yasbeck, Mrs Antoni",3rd,15.00,female,1,1

In [31]:
df_titanic.groupby(['Sex', 'Survived'])['PassengerID'].count()

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: PassengerID, dtype: int64

In [ ]:
А теперь проанализируем в разрезе класса кабины:

In [33]:
print(df_titanic.groupby(['PClass', 'Survived'])['PassengerID'].count())

PClass  Survived
*       0             1
1st     0           129
        1           193
2nd     0           160
        1           119
3rd     0           573
        1           138
Name: PassengerID, dtype: int64

In [34]:
pvt = df_titanic.pivot_table(index=['Sex'], columns=['PClass'], values='Name', aggfunc='count')

In [35]:
pvt

PClass    *    1st    2nd    3rd
Sex
female  NaN  143.0  107.0  212.0
male    1.0  179.0  172.0  499.0

In [ ]:
Пример про страны

In [ ]:
from pandas import read_csv
df1 = read_csv("df1.txt")
df2 = read_csv("df2.txt",";")

In [10]:
print(df1)
print(df2)

   shop  qty
0   427    3
1   707    4
2   957    2
3   437    1
   shop   country     name
0   347   Украина     Киев
1   427        РФ   Самара
2   707  Беларусь    Минск
3   957        РФ  Иркутск
4   437        РФ   Москва

In [9]:
country = [u'Украина',u'РФ',u'Беларусь',u'РФ',u'РФ']
df2.insert(1,'country',country)

In [13]:
print(df2)

   shop  qty
0   427    3
1   707    4
2   957    2
3   437    1
   shop   country     name
0   347   Украина     Киев
1   427        РФ   Самара
2   707  Беларусь    Минск
3   957        РФ  Иркутск
4   437        РФ   Москва

In [12]:
print(df2.country)

0     Украина
1          РФ
2    Беларусь
3          РФ
4          РФ
Name: country, dtype: object

In [30]:
t = df2[df2.country == u'Украина']
t.shop = 345

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:3110: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [37]:
df2.append(t)

   shop   country     name
0   347   Украина     Киев
1   427        РФ   Самара
2   707  Беларусь    Минск
3   957        РФ  Иркутск
4   437        РФ   Москва
0   345   Украина     Киев

In [38]:
res = df2.merge(df1, 'left', on='shop')

In [41]:
print(df2)
print(df1)
print(res)

   shop   country     name
0   347   Украина     Киев
1   427        РФ   Самара
2   707  Беларусь    Минск
3   957        РФ  Иркутск
4   437        РФ   Москва
   shop  qty
0   427    3
1   707    4
2   957    2
3   437    1
   shop   country     name  qty
0   347   Украина     Киев  NaN
1   427        РФ   Самара  3.0
2   707  Беларусь    Минск  4.0
3   957        РФ  Иркутск  2.0
4   437        РФ   Москва  1.0

In [3]:
res.pivot_table(['qty'],['country'], aggfunc='sum', fill_value = 0)

NameError: name 'res' is not defined

In [1]:
import pandas as pd
import numpy as np
series = pd.Series(data=[111, 222, 3], index = ['one','two','three'])
#or even
series = pd.Series([111, 222, 3])

In [2]:
print(series['one'])
or
print(series[0])
#Multiple columns
print(series[['one','two']]

SyntaxError: invalid syntax (<ipython-input-2-d2bfc27d0f1a>, line 2)